app/controllers/artists_controller.rb

SELECT  "preferences".* FROM "preferences" ORDER BY "preferences"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def new
    # binding.pry
    if Preference.first.allow_create_artists