app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT ?  [["artist_id", 1], ["id", 12345], ["LIMIT", 1]]
---
  def show
    # binding.pry
    if params[:artist_id]
      @artist = Artist.find_by(id: params[:artist_id])
      @song = @artist.songs.find_by(id: params[:id])

SELECT  "preferences".* FROM "preferences" ORDER BY "preferences"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def new
    if Preference.first.allow_create_songs

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    # binding.pry
    @song = Song.find(params[:id])